<!-- 1 задание готово -->

<!-- 2 задание переписывать сюда смысла не вижу. Всё понятно, разобрался -->

<!-- 3 задание -->

<?php
    $a = 5;
    $b = '05';
    var_dump($a == $b);         // Почему true? Ответ: Из-за динамической типизации сравниваются числа, а 5 = 5.
    var_dump((int)'012345');     // Почему 12345? Ответ: Потому что ноль впереди целочисленного числа стоять не может.
    var_dump((float)123.0 === (int)123.0); // Почему false? Ответ: Потому что в PHP "===" сравнивает не только данные, но и их тип.
    var_dump((int)0 === (int)'hello, world'); // Почему true? Ответ: Потому что текст в integer - 0.
?>

<!-- 4 задание -->

<?php
    $title = "Приветствую";
    $header = "И ещё раз приветствую";
    $currentYear = date('Y');
?>

<head>
    <title><? echo $title; ?></title>
</head>
<body>
    <h1><? echo $header; ?></h1>
    <p>Сейчас <? echo $currentYear; ?> год.</p>
</body>

<!-- 5 задание -->
<?php
    $a = 1;
    $b = 2;
    $a = $a + $b;
    $b = $a - $b;
    $a = $a - $b;
?>